'''
Вывести квадрат числа
'''
inputNum = int(input('Введите число: '))
print(f'Вами было введено число {inputNum}, квадрат этого числа равен {inputNum ** 2}')